Revit 2024 API
Transform2D.Determinant Property
 The determinant of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public double Determinant { get; }
Visual Basic
Public ReadOnly Property Determinant As Double
	Get
Visual C++
public:
property double Determinant {
	double get ();
}
Remarks
 The geometric meaning of a determinant is as the scale factor for volume when applied as linear transformation.
See Also
Transform2D Class
Autodesk.Revit.DB Namespace